app/controllers/questions_controller.rb

INSERT INTO "questions" ("description", "answer_type", "marks", "correct_answer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["description", "dscssd"], ["answer_type", "cdsc"], ["marks", 1], ["correct_answer", "csdcs"], ["created_at", "2015-03-02 14:03:03.701910"], ["updated_at", "2015-03-02 14:03:03.701910"]]
---
  def create
    @question = Question.new(question_params_without_blank_question_parts)

    respond_to do |format|
      if @question.save